MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K42/mcu.h
extern volatile U2P1Lbits_t U2P1Lbits __at(0x3DD4);
// bitfield macros
#define _U2P1L_P1L_POSN                                     0x0
#define _U2P1L_P1L_POSITION                                 0x0
#define _U2P1L_P1L_SIZE                                     0x8
#define _U2P1L_P1L_LENGTH                                   0x8
#define _U2P1L_P1L_MASK                                     0xFF

// Register: U2P2
#define U2P2 U2P2
extern volatile unsigned char           U2P2                __at(0x3DD6);
#ifndef _LIB_BUILD
asm("U2P2 equ 03DD6h");
#endif

// Register: U2P2L
#define U2P2L U2P2L
extern volatile unsigned char           U2P2L               __at(0x3DD6);
#ifndef _LIB_BUILD
asm("U2P2L equ 03DD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
} U2P2Lbits_t;
extern volatile U2P2Lbits_t U2P2Lbits __at(0x3DD6);
// bitfield macros
#define _U2P2L_P2L_POSN                                     0x0
#define _U2P2L_P2L_POSITION                                 0x0
#define _U2P2L_P2L_SIZE                                     0x8
#define _U2P2L_P2L_LENGTH                                   0x8
#define _U2P2L_P2L_MASK                                     0xFF

// Register: U2P3
#define U2P3 U2P3
extern volatile unsigned char           U2P3                __at(0x3DD8);
#ifndef _LIB_BUILD
asm("U2P3 equ 03DD8h");
#endif

// Register: U2P3L
#define U2P3L U2P3L
extern volatile unsigned char           U2P3L               __at(0x3DD8);
#ifndef _LIB_BUILD
asm("U2P3L equ 03DD8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3L                    :8;
    };
} U2P3Lbits_t;
extern volatile U2P3Lbits_t U2P3Lbits __at(0x3DD8);
// bitfield macros
#define _U2P3L_P3L_POSN                                     0x0
#define _U2P3L_P3L_POSITION                                 0x0
#define _U2P3L_P3L_SIZE                                     0x8
#define _U2P3L_P3L_LENGTH                                   0x8
#define _U2P3L_P3L_MASK                                     0xFF

// Register: U2CON0
#define U2CON0 U2CON0
extern volatile unsigned char           U2CON0              __at(0x3DDA);
#ifndef _LIB_BUILD
asm("U2CON0 equ 03DDAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned U2MODE                 :4;
        unsigned U2RXEN                 :1;
        unsigned U2TXEN                 :1;
        unsigned U2ABDEN                :1;
        unsigned U2BRGS                 :1;
    };
    struct {
        unsigned U2MODE0                :1;
        unsigned U2MODE1                :1;
        unsigned U2MODE2                :1;
    };
    struct {
        unsigned MODE                   :4;
        unsigned RXEN                   :1;
        unsigned TXEN                   :1;
        unsigned ABDEN                  :1;
        unsigned BRGS                   :1;
    };
} U2CON0bits_t;
extern volatile U2CON0bits_t U2CON0bits __at(0x3DDA);
// bitfield macros
#define _U2CON0_MODE0_POSN                                  0x0
#define _U2CON0_MODE0_POSITION                              0x0
#define _U2CON0_MODE0_SIZE                                  0x1
#define _U2CON0_MODE0_LENGTH                                0x1
#define _U2CON0_MODE0_MASK                                  0x1
#define _U2CON0_MODE1_POSN                                  0x1
#define _U2CON0_MODE1_POSITION                              0x1
#define _U2CON0_MODE1_SIZE                                  0x1
#define _U2CON0_MODE1_LENGTH                                0x1
#define _U2CON0_MODE1_MASK                                  0x2
#define _U2CON0_MODE2_POSN                                  0x2
#define _U2CON0_MODE2_POSITION                              0x2
#define _U2CON0_MODE2_SIZE                                  0x1
#define _U2CON0_MODE2_LENGTH                                0x1
#define _U2CON0_MODE2_MASK                                  0x4
#define _U2CON0_U2MODE_POSN                                 0x0
#define _U2CON0_U2MODE_POSITION                             0x0
#define _U2CON0_U2MODE_SIZE                                 0x4
#define _U2CON0_U2MODE_LENGTH                               0x4
#define _U2CON0_U2MODE_MASK                                 0xF
#define _U2CON0_U2RXEN_POSN                                 0x4
#define _U2CON0_U2RXEN_POSITION                             0x4
#define _U2CON0_U2RXEN_SIZE                                 0x1
#define _U2CON0_U2RXEN_LENGTH                               0x1
#define _U2CON0_U2RXEN_MASK                                 0x10
#define _U2CON0_U2TXEN_POSN                                 0x5
#define _U2CON0_U2TXEN_POSITION                             0x5
#define _U2CON0_U2TXEN_SIZE                                 0x1
#define _U2CON0_U2TXEN_LENGTH                               0x1
#define _U2CON0_U2TXEN_MASK                                 0x20
#define _U2CON0_U2ABDEN_POSN                                0x6
#define _U2CON0_U2ABDEN_POSITION                            0x6
#define _U2CON0_U2ABDEN_SIZE                                0x1
#define _U2CON0_U2ABDEN_LENGTH                              0x1
#define _U2CON0_U2ABDEN_MASK                                0x40
#define _U2CON0_U2BRGS_POSN                                 0x7
#define _U2CON0_U2BRGS_POSITION                             0x7
#define _U2CON0_U2BRGS_SIZE                                 0x1
#define _U2CON0_U2BRGS_LENGTH                               0x1
#define _U2CON0_U2BRGS_MASK                                 0x80
#define _U2CON0_U2MODE0_POSN                                0x0
#define _U2CON0_U2MODE0_POSITION                            0x0
#define _U2CON0_U2MODE0_SIZE                                0x1
#define _U2CON0_U2MODE0_LENGTH                              0x1
#define _U2CON0_U2MODE0_MASK                                0x1
#define _U2CON0_U2MODE1_POSN                                0x1
#define _U2CON0_U2MODE1_POSITION                            0x1
#define _U2CON0_U2MODE1_SIZE                                0x1
#define _U2CON0_U2MODE1_LENGTH                              0x1
#define _U2CON0_U2MODE1_MASK                                0x2
#define _U2CON0_U2MODE2_POSN                                0x2
#define _U2CON0_U2MODE2_POSITION                            0x2
#define _U2CON0_U2MODE2_SIZE                                0x1
#define _U2CON0_U2MODE2_LENGTH                              0x1
#define _U2CON0_U2MODE2_MASK                                0x4
#define _U2CON0_MODE_POSN                                   0x0
#define _U2CON0_MODE_POSITION                               0x0
#define _U2CON0_MODE_SIZE                                   0x4
#define _U2CON0_MODE_LENGTH                                 0x4
#define _U2CON0_MODE_MASK                                   0xF
#define _U2CON0_RXEN_POSN                                   0x4
#define _U2CON0_RXEN_POSITION                               0x4
#define _U2CON0_RXEN_SIZE                                   0x1
#define _U2CON0_RXEN_LENGTH                                 0x1
#define _U2CON0_RXEN_MASK                                   0x10
#define _U2CON0_TXEN_POSN                                   0x5
#define _U2CON0_TXEN_POSITION                               0x5
#define _U2CON0_TXEN_SIZE                                   0x1
#define _U2CON0_TXEN_LENGTH                                 0x1
#define _U2CON0_TXEN_MASK                                   0x20
#define _U2CON0_ABDEN_POSN                                  0x6
#define _U2CON0_ABDEN_POSITION                              0x6
#define _U2CON0_ABDEN_SIZE                                  0x1
#define _U2CON0_ABDEN_LENGTH                                0x1
#define _U2CON0_ABDEN_MASK                                  0x40
#define _U2CON0_BRGS_POSN                                   0x7
#define _U2CON0_BRGS_POSITION                               0x7
#define _U2CON0_BRGS_SIZE                                   0x1
#define _U2CON0_BRGS_LENGTH                                 0x1
#define _U2CON0_BRGS_MASK                                   0x80

// Register: U2CON1
#define U2CON1 U2CON1
extern volatile unsigned char           U2CON1              __at(0x3DDB);
#ifndef _LIB_BUILD
asm("U2CON1 equ 03DDBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SENDB                  :1;
        unsigned BRKOVR                 :1;
        unsigned                        :1;
        unsigned RXBIMD                 :1;
        unsigned WUE                    :1;
        unsigned                        :2;
        unsigned ON                     :1;
    };
    struct {
        unsigned U2SENDB                :1;
        unsigned U2BRKOVR               :1;
        unsigned                        :1;
        unsigned U2RXBIMD               :1;
        unsigned U2WUE                  :1;
        unsigned                        :2;
        unsigned U2ON                   :1;
    };
} U2CON1bits_t;
