MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K42/mcu.h
#define                                 ANSELC1_bit         _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSELC2>
extern volatile __bit                   ANSELC2             __at(0x1D302);	// @ (0x3A60 * 8 + 2)
#define                                 ANSELC2_bit         _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSELC3>
extern volatile __bit                   ANSELC3             __at(0x1D303);	// @ (0x3A60 * 8 + 3)
#define                                 ANSELC3_bit         _BIT_ACCESS(ANSELC,3)
// ANSELC<ANSELC4>
extern volatile __bit                   ANSELC4             __at(0x1D304);	// @ (0x3A60 * 8 + 4)
#define                                 ANSELC4_bit         _BIT_ACCESS(ANSELC,4)
// ANSELC<ANSELC5>
extern volatile __bit                   ANSELC5             __at(0x1D305);	// @ (0x3A60 * 8 + 5)
#define                                 ANSELC5_bit         _BIT_ACCESS(ANSELC,5)
// ANSELC<ANSELC6>
extern volatile __bit                   ANSELC6             __at(0x1D306);	// @ (0x3A60 * 8 + 6)
#define                                 ANSELC6_bit         _BIT_ACCESS(ANSELC,6)
// ANSELC<ANSELC7>
extern volatile __bit                   ANSELC7             __at(0x1D307);	// @ (0x3A60 * 8 + 7)
#define                                 ANSELC7_bit         _BIT_ACCESS(ANSELC,7)
// SMT1STAT<AS>
extern volatile __bit                   AS                  __at(0x1F900);	// @ (0x3F20 * 8 + 0)
#define                                 AS_bit              _BIT_ACCESS(SMT1STAT,0)
// T0CON1<ASYNC>
extern volatile __bit                   ASYNC               __at(0x1FDCC);	// @ (0x3FB9 * 8 + 4)
#define                                 ASYNC_bit           _BIT_ACCESS(T0CON1,4)
// IVTBASEL<BASE0>
extern volatile __bit                   BASE0               __at(0x1FEA8);	// @ (0x3FD5 * 8 + 0)
#define                                 BASE0_bit           _BIT_ACCESS(IVTBASEL,0)
// IVTBASEL<BASE1>
extern volatile __bit                   BASE1               __at(0x1FEA9);	// @ (0x3FD5 * 8 + 1)
#define                                 BASE1_bit           _BIT_ACCESS(IVTBASEL,1)
// IVTBASEH<BASE10>
extern volatile __bit                   BASE10              __at(0x1FEB2);	// @ (0x3FD6 * 8 + 2)
#define                                 BASE10_bit          _BIT_ACCESS(IVTBASEH,2)
// IVTBASEH<BASE11>
extern volatile __bit                   BASE11              __at(0x1FEB3);	// @ (0x3FD6 * 8 + 3)
#define                                 BASE11_bit          _BIT_ACCESS(IVTBASEH,3)
// IVTBASEH<BASE12>
extern volatile __bit                   BASE12              __at(0x1FEB4);	// @ (0x3FD6 * 8 + 4)
#define                                 BASE12_bit          _BIT_ACCESS(IVTBASEH,4)
// IVTBASEH<BASE13>
extern volatile __bit                   BASE13              __at(0x1FEB5);	// @ (0x3FD6 * 8 + 5)
#define                                 BASE13_bit          _BIT_ACCESS(IVTBASEH,5)
// IVTBASEH<BASE14>
extern volatile __bit                   BASE14              __at(0x1FEB6);	// @ (0x3FD6 * 8 + 6)
#define                                 BASE14_bit          _BIT_ACCESS(IVTBASEH,6)
// IVTBASEH<BASE15>
extern volatile __bit                   BASE15              __at(0x1FEB7);	// @ (0x3FD6 * 8 + 7)
#define                                 BASE15_bit          _BIT_ACCESS(IVTBASEH,7)
// IVTBASEU<BASE16>
extern volatile __bit                   BASE16              __at(0x1FEB8);	// @ (0x3FD7 * 8 + 0)
#define                                 BASE16_bit          _BIT_ACCESS(IVTBASEU,0)
// IVTBASEU<BASE17>
extern volatile __bit                   BASE17              __at(0x1FEB9);	// @ (0x3FD7 * 8 + 1)
#define                                 BASE17_bit          _BIT_ACCESS(IVTBASEU,1)
// IVTBASEU<BASE18>
extern volatile __bit                   BASE18              __at(0x1FEBA);	// @ (0x3FD7 * 8 + 2)
#define                                 BASE18_bit          _BIT_ACCESS(IVTBASEU,2)
// IVTBASEU<BASE19>
extern volatile __bit                   BASE19              __at(0x1FEBB);	// @ (0x3FD7 * 8 + 3)
#define                                 BASE19_bit          _BIT_ACCESS(IVTBASEU,3)
// IVTBASEL<BASE2>
extern volatile __bit                   BASE2               __at(0x1FEAA);	// @ (0x3FD5 * 8 + 2)
#define                                 BASE2_bit           _BIT_ACCESS(IVTBASEL,2)
// IVTBASEU<BASE20>
extern volatile __bit                   BASE20              __at(0x1FEBC);	// @ (0x3FD7 * 8 + 4)
#define                                 BASE20_bit          _BIT_ACCESS(IVTBASEU,4)
// IVTBASEL<BASE3>
extern volatile __bit                   BASE3               __at(0x1FEAB);	// @ (0x3FD5 * 8 + 3)
#define                                 BASE3_bit           _BIT_ACCESS(IVTBASEL,3)
// IVTBASEL<BASE4>
extern volatile __bit                   BASE4               __at(0x1FEAC);	// @ (0x3FD5 * 8 + 4)
#define                                 BASE4_bit           _BIT_ACCESS(IVTBASEL,4)
// IVTBASEL<BASE5>
extern volatile __bit                   BASE5               __at(0x1FEAD);	// @ (0x3FD5 * 8 + 5)
#define                                 BASE5_bit           _BIT_ACCESS(IVTBASEL,5)
// IVTBASEL<BASE6>
extern volatile __bit                   BASE6               __at(0x1FEAE);	// @ (0x3FD5 * 8 + 6)
#define                                 BASE6_bit           _BIT_ACCESS(IVTBASEL,6)
// IVTBASEL<BASE7>
extern volatile __bit                   BASE7               __at(0x1FEAF);	// @ (0x3FD5 * 8 + 7)
#define                                 BASE7_bit           _BIT_ACCESS(IVTBASEL,7)
// IVTBASEH<BASE8>
extern volatile __bit                   BASE8               __at(0x1FEB0);	// @ (0x3FD6 * 8 + 0)
#define                                 BASE8_bit           _BIT_ACCESS(IVTBASEH,0)
// IVTBASEH<BASE9>
extern volatile __bit                   BASE9               __at(0x1FEB1);	// @ (0x3FD6 * 8 + 1)
#define                                 BASE9_bit           _BIT_ACCESS(IVTBASEH,1)
// SPI1BAUD<BAUD0>
extern volatile __bit                   BAUD0               __at(0x1E8C8);	// @ (0x3D19 * 8 + 0)
#define                                 BAUD0_bit           _BIT_ACCESS(SPI1BAUD,0)
// SPI1BAUD<BAUD1>
extern volatile __bit                   BAUD1               __at(0x1E8C9);	// @ (0x3D19 * 8 + 1)
#define                                 BAUD1_bit           _BIT_ACCESS(SPI1BAUD,1)
// SPI1BAUD<BAUD2>
extern volatile __bit                   BAUD2               __at(0x1E8CA);	// @ (0x3D19 * 8 + 2)
#define                                 BAUD2_bit           _BIT_ACCESS(SPI1BAUD,2)
// SPI1BAUD<BAUD3>
extern volatile __bit                   BAUD3               __at(0x1E8CB);	// @ (0x3D19 * 8 + 3)
#define                                 BAUD3_bit           _BIT_ACCESS(SPI1BAUD,3)
// SPI1BAUD<BAUD4>
extern volatile __bit                   BAUD4               __at(0x1E8CC);	// @ (0x3D19 * 8 + 4)
#define                                 BAUD4_bit           _BIT_ACCESS(SPI1BAUD,4)
// SPI1BAUD<BAUD5>
extern volatile __bit                   BAUD5               __at(0x1E8CD);	// @ (0x3D19 * 8 + 5)
#define                                 BAUD5_bit           _BIT_ACCESS(SPI1BAUD,5)
// SPI1BAUD<BAUD6>
extern volatile __bit                   BAUD6               __at(0x1E8CE);	// @ (0x3D19 * 8 + 6)
#define                                 BAUD6_bit           _BIT_ACCESS(SPI1BAUD,6)
// SPI1BAUD<BAUD7>
extern volatile __bit                   BAUD7               __at(0x1E8CF);	// @ (0x3D19 * 8 + 7)
#define                                 BAUD7_bit           _BIT_ACCESS(SPI1BAUD,7)
// I2C1ERR<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x1EBB1);	// @ (0x3D76 * 8 + 1)
#define                                 BCL1IE_bit          _BIT_ACCESS(I2C1ERR,1)
// I2C1ERR<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x1EBB5);	// @ (0x3D76 * 8 + 5)
#define                                 BCL1IF_bit          _BIT_ACCESS(I2C1ERR,5)
// I2C2ERR<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x1EB01);	// @ (0x3D60 * 8 + 1)
#define                                 BCL2IE_bit          _BIT_ACCESS(I2C2ERR,1)
// I2C2ERR<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0x1EB05);	// @ (0x3D60 * 8 + 5)
#define                                 BCL2IF_bit          _BIT_ACCESS(I2C2ERR,5)
// MD1CON0<BIT>
extern volatile __bit                   BIT                 __at(0x1E7D0);	// @ (0x3CFA * 8 + 0)
#define                                 BIT_bit             _BIT_ACCESS(MD1CON0,0)
// SPI1CON0<BMODE>
extern volatile __bit                   BMODE               __at(0x1E8A0);	// @ (0x3D14 * 8 + 0)
#define                                 BMODE_bit           _BIT_ACCESS(SPI1CON0,0)
// PCON0<BOR>
extern volatile __bit                   BOR                 __at(0x1FF80);	// @ (0x3FF0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(PCON0,0)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x1CE80);	// @ (0x39D0 * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// I2C1ERR<BTO1IE>
extern volatile __bit                   BTO1IE              __at(0x1EBB2);	// @ (0x3D76 * 8 + 2)
#define                                 BTO1IE_bit          _BIT_ACCESS(I2C1ERR,2)
// I2C1ERR<BTO1IF>
extern volatile __bit                   BTO1IF              __at(0x1EBB6);	// @ (0x3D76 * 8 + 6)
#define                                 BTO1IF_bit          _BIT_ACCESS(I2C1ERR,6)
// I2C2ERR<BTO2IE>
extern volatile __bit                   BTO2IE              __at(0x1EB02);	// @ (0x3D60 * 8 + 2)
#define                                 BTO2IE_bit          _BIT_ACCESS(I2C2ERR,2)
// I2C2ERR<BTO2IF>
extern volatile __bit                   BTO2IF              __at(0x1EB06);	// @ (0x3D60 * 8 + 6)
#define                                 BTO2IF_bit          _BIT_ACCESS(I2C2ERR,6)
// SCANCON0<BURSTMD>
extern volatile __bit                   BURSTMD             __at(0x1CBE1);	// @ (0x397C * 8 + 1)
#define                                 BURSTMD_bit         _BIT_ACCESS(SCANCON0,1)
// U1CON2<C0EN>
extern volatile __bit                   C0EN                __at(0x1EFA3);	// @ (0x3DF4 * 8 + 3)
#define                                 C0EN_bit            _BIT_ACCESS(U1CON2,3)
// CM1CON0<C1EN>
extern volatile __bit                   C1EN                __at(0x1F5E7);	// @ (0x3EBC * 8 + 7)
#define                                 C1EN_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x1F5E1);	// @ (0x3EBC * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE1<C1IE>
extern volatile __bit                   C1IE                __at(0x1CC8C);	// @ (0x3991 * 8 + 4)
#define                                 C1IE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<C1IF>
extern volatile __bit                   C1IF                __at(0x1CD0C);	// @ (0x39A1 * 8 + 4)
#define                                 C1IF_bit            _BIT_ACCESS(PIR1,4)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x1F5E8);	// @ (0x3EBD * 8 + 0)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x1F5E9);	// @ (0x3EBD * 8 + 1)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,1)
// IPR1<C1IP>
extern volatile __bit                   C1IP                __at(0x1CC0C);	// @ (0x3981 * 8 + 4)
#define                                 C1IP_bit            _BIT_ACCESS(IPR1,4)
// CM1NCH<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x1F5F0);	// @ (0x3EBE * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1NCH,0)
// CM1NCH<C1NCH1>
extern volatile __bit                   C1NCH1              __at(0x1F5F1);	// @ (0x3EBE * 8 + 1)
#define                                 C1NCH1_bit          _BIT_ACCESS(CM1NCH,1)
// CM1NCH<C1NCH2>
extern volatile __bit                   C1NCH2              __at(0x1F5F2);	// @ (0x3EBE * 8 + 2)
#define                                 C1NCH2_bit          _BIT_ACCESS(CM1NCH,2)
// CM1PCH<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x1F5F8);	// @ (0x3EBF * 8 + 0)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1PCH,0)
// CM1PCH<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x1F5F9);	// @ (0x3EBF * 8 + 1)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1PCH,1)
// CM1PCH<C1PCH2>
extern volatile __bit                   C1PCH2              __at(0x1F5FA);	// @ (0x3EBF * 8 + 2)
#define                                 C1PCH2_bit          _BIT_ACCESS(CM1PCH,2)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x1F5E4);	// @ (0x3EBC * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x1F5E0);	// @ (0x3EBC * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x1FAF0);	// @ (0x3F5E * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x1FAF1);	// @ (0x3F5E * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CM2CON0<C2EN>
extern volatile __bit                   C2EN                __at(0x1F5C7);	// @ (0x3EB8 * 8 + 7)
#define                                 C2EN_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x1F5C1);	// @ (0x3EB8 * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE5<C2IE>
extern volatile __bit                   C2IE                __at(0x1CCA9);	// @ (0x3995 * 8 + 1)
#define                                 C2IE_bit            _BIT_ACCESS(PIE5,1)
// PIR5<C2IF>
extern volatile __bit                   C2IF                __at(0x1CD29);	// @ (0x39A5 * 8 + 1)
#define                                 C2IF_bit            _BIT_ACCESS(PIR5,1)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x1F5C8);	// @ (0x3EB9 * 8 + 0)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x1F5C9);	// @ (0x3EB9 * 8 + 1)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,1)
// IPR5<C2IP>
extern volatile __bit                   C2IP                __at(0x1CC29);	// @ (0x3985 * 8 + 1)
#define                                 C2IP_bit            _BIT_ACCESS(IPR5,1)
// CM2NCH<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x1F5D0);	// @ (0x3EBA * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2NCH,0)
// CM2NCH<C2NCH1>
extern volatile __bit                   C2NCH1              __at(0x1F5D1);	// @ (0x3EBA * 8 + 1)
#define                                 C2NCH1_bit          _BIT_ACCESS(CM2NCH,1)
// CM2NCH<C2NCH2>
extern volatile __bit                   C2NCH2              __at(0x1F5D2);	// @ (0x3EBA * 8 + 2)
#define                                 C2NCH2_bit          _BIT_ACCESS(CM2NCH,2)
// CM2PCH<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x1F5D8);	// @ (0x3EBB * 8 + 0)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2PCH,0)
// CM2PCH<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x1F5D9);	// @ (0x3EBB * 8 + 1)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2PCH,1)
// CM2PCH<C2PCH2>
extern volatile __bit                   C2PCH2              __at(0x1F5DA);	// @ (0x3EBB * 8 + 2)
#define                                 C2PCH2_bit          _BIT_ACCESS(CM2PCH,2)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x1F5C4);	// @ (0x3EB8 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x1F5C0);	// @ (0x3EB8 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x1FAF2);	// @ (0x3F5E * 8 + 2)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS0,2)
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x1FAF3);	// @ (0x3F5E * 8 + 3)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS0,3)
// CCPTMRS0<C3TSEL0>
extern volatile __bit                   C3TSEL0             __at(0x1FAF4);	// @ (0x3F5E * 8 + 4)
#define                                 C3TSEL0_bit         _BIT_ACCESS(CCPTMRS0,4)
// CCPTMRS0<C3TSEL1>
extern volatile __bit                   C3TSEL1             __at(0x1FAF5);	// @ (0x3F5E * 8 + 5)
#define                                 C3TSEL1_bit         _BIT_ACCESS(CCPTMRS0,5)
// CCPTMRS0<C4TSEL0>
extern volatile __bit                   C4TSEL0             __at(0x1FAF6);	// @ (0x3F5E * 8 + 6)
#define                                 C4TSEL0_bit         _BIT_ACCESS(CCPTMRS0,6)
// CCPTMRS0<C4TSEL1>
extern volatile __bit                   C4TSEL1             __at(0x1FAF7);	// @ (0x3F5E * 8 + 7)
#define                                 C4TSEL1_bit         _BIT_ACCESS(CCPTMRS0,7)
// ADCON3<CALC0>
extern volatile __bit                   CALC0               __at(0x1F7DC);	// @ (0x3EFB * 8 + 4)
#define                                 CALC0_bit           _BIT_ACCESS(ADCON3,4)
// ADCON3<CALC1>
extern volatile __bit                   CALC1               __at(0x1F7DD);	// @ (0x3EFB * 8 + 5)
#define                                 CALC1_bit           _BIT_ACCESS(ADCON3,5)
// ADCON3<CALC2>
extern volatile __bit                   CALC2               __at(0x1F7DE);	// @ (0x3EFB * 8 + 6)
#define                                 CALC2_bit           _BIT_ACCESS(ADCON3,6)
// ADCAP<CAP0>
extern volatile __bit                   CAP0                __at(0x1F7A8);	// @ (0x3EF5 * 8 + 0)
#define                                 CAP0_bit            _BIT_ACCESS(ADCAP,0)
// ADCAP<CAP1>
extern volatile __bit                   CAP1                __at(0x1F7A9);	// @ (0x3EF5 * 8 + 1)
#define                                 CAP1_bit            _BIT_ACCESS(ADCAP,1)
// ADCAP<CAP2>
extern volatile __bit                   CAP2                __at(0x1F7AA);	// @ (0x3EF5 * 8 + 2)
#define                                 CAP2_bit            _BIT_ACCESS(ADCAP,2)
// ADCAP<CAP3>
extern volatile __bit                   CAP3                __at(0x1F7AB);	// @ (0x3EF5 * 8 + 3)
#define                                 CAP3_bit            _BIT_ACCESS(ADCAP,3)
// ADCAP<CAP4>
extern volatile __bit                   CAP4                __at(0x1F7AC);	// @ (0x3EF5 * 8 + 4)
#define                                 CAP4_bit            _BIT_ACCESS(ADCAP,4)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x1FEC0);	// @ (0x3FD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CCDCON<CCDEN>
extern volatile __bit                   CCDEN               __at(0x1D5F7);	// @ (0x3ABE * 8 + 7)
#define                                 CCDEN_bit           _BIT_ACCESS(CCDCON,7)
// CCDNA<CCDNA0>
extern volatile __bit                   CCDNA0              __at(0x1D248);	// @ (0x3A49 * 8 + 0)
#define                                 CCDNA0_bit          _BIT_ACCESS(CCDNA,0)
// CCDNA<CCDNA1>
extern volatile __bit                   CCDNA1              __at(0x1D249);	// @ (0x3A49 * 8 + 1)
#define                                 CCDNA1_bit          _BIT_ACCESS(CCDNA,1)
// CCDNA<CCDNA2>
extern volatile __bit                   CCDNA2              __at(0x1D24A);	// @ (0x3A49 * 8 + 2)
#define                                 CCDNA2_bit          _BIT_ACCESS(CCDNA,2)
// CCDNA<CCDNA3>
extern volatile __bit                   CCDNA3              __at(0x1D24B);	// @ (0x3A49 * 8 + 3)
#define                                 CCDNA3_bit          _BIT_ACCESS(CCDNA,3)
// CCDNA<CCDNA4>
extern volatile __bit                   CCDNA4              __at(0x1D24C);	// @ (0x3A49 * 8 + 4)
#define                                 CCDNA4_bit          _BIT_ACCESS(CCDNA,4)
// CCDNA<CCDNA5>
extern volatile __bit                   CCDNA5              __at(0x1D24D);	// @ (0x3A49 * 8 + 5)
#define                                 CCDNA5_bit          _BIT_ACCESS(CCDNA,5)
// CCDNA<CCDNA6>
extern volatile __bit                   CCDNA6              __at(0x1D24E);	// @ (0x3A49 * 8 + 6)
#define                                 CCDNA6_bit          _BIT_ACCESS(CCDNA,6)
// CCDNA<CCDNA7>
extern volatile __bit                   CCDNA7              __at(0x1D24F);	// @ (0x3A49 * 8 + 7)
#define                                 CCDNA7_bit          _BIT_ACCESS(CCDNA,7)
// CCDNB<CCDNB0>
extern volatile __bit                   CCDNB0              __at(0x1D2C8);	// @ (0x3A59 * 8 + 0)
#define                                 CCDNB0_bit          _BIT_ACCESS(CCDNB,0)
// CCDNB<CCDNB1>
extern volatile __bit                   CCDNB1              __at(0x1D2C9);	// @ (0x3A59 * 8 + 1)
#define                                 CCDNB1_bit          _BIT_ACCESS(CCDNB,1)
// CCDNB<CCDNB2>
extern volatile __bit                   CCDNB2              __at(0x1D2CA);	// @ (0x3A59 * 8 + 2)
#define                                 CCDNB2_bit          _BIT_ACCESS(CCDNB,2)
// CCDNB<CCDNB3>
extern volatile __bit                   CCDNB3              __at(0x1D2CB);	// @ (0x3A59 * 8 + 3)
#define                                 CCDNB3_bit          _BIT_ACCESS(CCDNB,3)
// CCDNB<CCDNB4>
extern volatile __bit                   CCDNB4              __at(0x1D2CC);	// @ (0x3A59 * 8 + 4)
#define                                 CCDNB4_bit          _BIT_ACCESS(CCDNB,4)
// CCDNB<CCDNB5>
extern volatile __bit                   CCDNB5              __at(0x1D2CD);	// @ (0x3A59 * 8 + 5)
#define                                 CCDNB5_bit          _BIT_ACCESS(CCDNB,5)
// CCDNB<CCDNB6>
extern volatile __bit                   CCDNB6              __at(0x1D2CE);	// @ (0x3A59 * 8 + 6)
#define                                 CCDNB6_bit          _BIT_ACCESS(CCDNB,6)
// CCDNB<CCDNB7>
extern volatile __bit                   CCDNB7              __at(0x1D2CF);	// @ (0x3A59 * 8 + 7)
#define                                 CCDNB7_bit          _BIT_ACCESS(CCDNB,7)
// CCDNC<CCDNC0>
extern volatile __bit                   CCDNC0              __at(0x1D348);	// @ (0x3A69 * 8 + 0)
#define                                 CCDNC0_bit          _BIT_ACCESS(CCDNC,0)
// CCDNC<CCDNC1>
extern volatile __bit                   CCDNC1              __at(0x1D349);	// @ (0x3A69 * 8 + 1)
#define                                 CCDNC1_bit          _BIT_ACCESS(CCDNC,1)
// CCDNC<CCDNC2>
extern volatile __bit                   CCDNC2              __at(0x1D34A);	// @ (0x3A69 * 8 + 2)
#define                                 CCDNC2_bit          _BIT_ACCESS(CCDNC,2)
// CCDNC<CCDNC3>
extern volatile __bit                   CCDNC3              __at(0x1D34B);	// @ (0x3A69 * 8 + 3)
#define                                 CCDNC3_bit          _BIT_ACCESS(CCDNC,3)
// CCDNC<CCDNC4>
extern volatile __bit                   CCDNC4              __at(0x1D34C);	// @ (0x3A69 * 8 + 4)
#define                                 CCDNC4_bit          _BIT_ACCESS(CCDNC,4)
// CCDNC<CCDNC5>
extern volatile __bit                   CCDNC5              __at(0x1D34D);	// @ (0x3A69 * 8 + 5)
#define                                 CCDNC5_bit          _BIT_ACCESS(CCDNC,5)
