MikroElektronika/core_packages/PIC/XC8/def/PIC18F26K42/mcu.h
#define                                 X3_bit              _BIT_ACCESS(CRCXORL,3)
// CRCXORL<X4>
extern volatile __bit                   X4                  __at(0x1CB34);	// @ (0x3966 * 8 + 4)
#define                                 X4_bit              _BIT_ACCESS(CRCXORL,4)
// CRCXORL<X5>
extern volatile __bit                   X5                  __at(0x1CB35);	// @ (0x3966 * 8 + 5)
#define                                 X5_bit              _BIT_ACCESS(CRCXORL,5)
// CRCXORL<X6>
extern volatile __bit                   X6                  __at(0x1CB36);	// @ (0x3966 * 8 + 6)
#define                                 X6_bit              _BIT_ACCESS(CRCXORL,6)
// CRCXORL<X7>
extern volatile __bit                   X7                  __at(0x1CB37);	// @ (0x3966 * 8 + 7)
#define                                 X7_bit              _BIT_ACCESS(CRCXORL,7)
// CRCXORH<X8>
extern volatile __bit                   X8                  __at(0x1CB38);	// @ (0x3967 * 8 + 0)
#define                                 X8_bit              _BIT_ACCESS(CRCXORH,0)
// CRCXORH<X9>
extern volatile __bit                   X9                  __at(0x1CB39);	// @ (0x3967 * 8 + 1)
#define                                 X9_bit              _BIT_ACCESS(CRCXORH,1)
// PIE1<ZCDIE>
extern volatile __bit                   ZCDIE               __at(0x1CC89);	// @ (0x3991 * 8 + 1)
#define                                 ZCDIE_bit           _BIT_ACCESS(PIE1,1)
// PIR1<ZCDIF>
extern volatile __bit                   ZCDIF               __at(0x1CD09);	// @ (0x39A1 * 8 + 1)
#define                                 ZCDIF_bit           _BIT_ACCESS(PIR1,1)
// ZCDCON<ZCDINTN>
extern volatile __bit                   ZCDINTN             __at(0x1F618);	// @ (0x3EC3 * 8 + 0)
#define                                 ZCDINTN_bit         _BIT_ACCESS(ZCDCON,0)
// ZCDCON<ZCDINTP>
extern volatile __bit                   ZCDINTP             __at(0x1F619);	// @ (0x3EC3 * 8 + 1)
#define                                 ZCDINTP_bit         _BIT_ACCESS(ZCDCON,1)
// IPR1<ZCDIP>
extern volatile __bit                   ZCDIP               __at(0x1CC09);	// @ (0x3981 * 8 + 1)
#define                                 ZCDIP_bit           _BIT_ACCESS(IPR1,1)
// PMD2<ZCDMD>
extern volatile __bit                   ZCDMD               __at(0x1CE10);	// @ (0x39C2 * 8 + 0)
#define                                 ZCDMD_bit           _BIT_ACCESS(PMD2,0)
// ZCDCON<ZCDOUT>
extern volatile __bit                   ZCDOUT              __at(0x1F61D);	// @ (0x3EC3 * 8 + 5)
#define                                 ZCDOUT_bit          _BIT_ACCESS(ZCDCON,5)
// ZCDCON<ZCDPOL>
extern volatile __bit                   ZCDPOL              __at(0x1F61C);	// @ (0x3EC3 * 8 + 4)
#define                                 ZCDPOL_bit          _BIT_ACCESS(ZCDCON,4)
// ZCDCON<ZCDSEN>
extern volatile __bit                   ZCDSEN              __at(0x1F61F);	// @ (0x3EC3 * 8 + 7)
#define                                 ZCDSEN_bit          _BIT_ACCESS(ZCDCON,7)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1FEC2);	// @ (0x3FD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// PCON0<nBOR>
extern volatile __bit                   nBOR                __at(0x1FF80);	// @ (0x3FF0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(PCON0,0)
// PCON1<nMEMV>
extern volatile __bit                   nMEMV               __at(0x1FF89);	// @ (0x3FF1 * 8 + 1)
#define                                 nMEMV_bit           _BIT_ACCESS(PCON1,1)
// PCON0<nPOR>
extern volatile __bit                   nPOR                __at(0x1FF81);	// @ (0x3FF0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(PCON0,1)
// PCON0<nRI>
extern volatile __bit                   nRI                 __at(0x1FF82);	// @ (0x3FF0 * 8 + 2)
#define                                 nRI_bit             _BIT_ACCESS(PCON0,2)
// PCON0<nRMCLR>
extern volatile __bit                   nRMCLR              __at(0x1FF83);	// @ (0x3FF0 * 8 + 3)
#define                                 nRMCLR_bit          _BIT_ACCESS(PCON0,3)
// PCON0<nRWDT>
extern volatile __bit                   nRWDT               __at(0x1FF84);	// @ (0x3FF0 * 8 + 4)
#define                                 nRWDT_bit           _BIT_ACCESS(PCON0,4)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x1FD92);	// @ (0x3FB2 * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x1FD32);	// @ (0x3FA6 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// T5CON<nT5SYNC>
extern volatile __bit                   nT5SYNC             __at(0x1FCD2);	// @ (0x3F9A * 8 + 2)
#define                                 nT5SYNC_bit         _BIT_ACCESS(T5CON,2)
// PCON0<nWDTWV>
extern volatile __bit                   nWDTWV              __at(0x1FF85);	// @ (0x3FF0 * 8 + 5)
#define                                 nWDTWV_bit          _BIT_ACCESS(PCON0,5)

#endif // _PIC18F26K42_H_
